/* ПРОЕКТ: «СЕКРЕТЫ ТЕМНОЛЕСЬЯ»
 
  Цель проекта: изучить влияние характеристик игроков и их игровых персонажей на покупку 
  внутриигровой валюты «райские лепестки», а также оценить активность игроков при совершении внутриигровых покупок. */

-- Часть 1. Исследовательский анализ данных
-- Задача 1. Исследование доли платящих игроков

-- 1.1. Доля платящих пользователей по всем данным:

select 
       COUNT (id) as count_users, -- общее кол-во игороков
       SUM (payer) as count_payers, -- платящие игроки 
       AVG(payer) as avg_payers -- доля платящих
       FROM fantasy.users u;
      
/*|count_users|count_payers|avg_payers  |
  |-----------|------------|------------|
  |22 214     |3 929       |0,1768704421|

       - общее количество игроков: 22 214;
       - количество платящих игроков: 3 929;
       - доля платящих игроков: ~17.7%.
Вывод: Примерно каждый шестой игрок совершает покупки внутри игры. Это типичный показатель для free-to-play игр, где большинство пользователей не тратит деньги.*/ 


-- 1.2. Доля платящих пользователей в разрезе расы персонажа:
      
select 
      DISTINCT r.race as race, -- уникальные расы
      COUNT (u.id) as count_users, -- зарегистрированные игроки
      SUM (u.payer) as count_payers,  -- платящие игроки
      SUM (u.payer) :: real / COUNT(u.id) :: real AS avg_payers -- доля платящих
      FROM fantasy.users u
      JOIN fantasy.race as r on u.race_id = r.race_id
      group by r.race
      order by count_payers DESC;
     
 /*|race    |count_users|count_payers|avg_payers|
   |--------|-----------|------------|----------|
   |Human   |6 328      |1 114       |0,17604299|
   |Hobbit  |3 648      |659         |0,18064693|
   |Orc     |3 619      |636         |0,17573915|
   |Northman|3 562      |626         |0,17574397|
   |Elf     |2 501      |427         |0,17073171|
   |Demon   |1 229      |238         |0,19365337|
   |Angel   |1 327      |229         |0,1725697 |
   
- наибольшая доля платящих игроков у расы Демоны (~19.4%);
- наименьшая доля у Эльфов (~17.1%) и Ангелов (~17.3%).

Вывод: Раса персонажа влияет на склонность к покупкам. Демоны и Хоббиты чаще совершают покупки, чем Эльфы и Ангелы. Возможно, это связано 
с особенностями игрового процесса или визуальным оформлением этих рас.*/
     
     
-- Задача 2. Исследование внутриигровых покупок
-- 2.1. Статистические показатели по полю amount:
     
with valid_purchases AS (
    select * 
    from fantasy.events
    where amount > 0)
    select
      ROUND(COUNT(amount):: numeric ,2) as count_purchase,-- общее количество покупок
      ROUND(SUM(amount):: numeric ,2) as sum_purchase, -- сумма всех покупок
      ROUND(MIN(amount):: numeric ,2) as min_purchase, -- минимальное кол-во покупок
      ROUND(MAX(amount):: numeric ,2) as max_purchase, -- максимальное кол-во покупок
      ROUND(AVG(amount):: numeric ,2) as avg_purchase, -- среднее кол-во покупок
      ROUND(stddev (amount) :: numeric ,2) as standart_amount, -- медиана, стандартное отклонение по стоимости
      ROUND(PERCENTILE_DISC(0.5) WITHIN GROUP (ORDER BY amount):: numeric ,2) as median
      from valid_purchases;

     /*|count_purchase|sum_purchase|min_purchase|max_purchase|avg_purchase|standart_amount|median|
       |--------------|------------|------------|------------|------------|---------------|------|
       |1 306 771     |686 615 000 |0,01        |486 615     |526,06      |2 518,18       |74,86 |

- средняя стоимость покупки: ~526.06.
- медианная стоимость: ~74.86.
- максимальная покупка: 486 615 (аномалия).

Вывод: Распределение покупок сильно скошено вправо — большинство покупок небольшие, но есть редкие крупные транзакции. Это типично для free-to-play игр, где основную выручку дают "киты" (whales).*/
     
     
-- 2.2: Аномальные нулевые покупки:
     
     -- Проверка наличия покупок с нулевой стоимостью
WITH total AS (
    SELECT COUNT(*) as total_cnt
    FROM fantasy.events),   -- всего покупок
    zero AS (
    SELECT COUNT(*) AS zero_cnt
    FROM fantasy.events
    WHERE amount = 0) -- покупки с нулевой стоимостью
SELECT 
    zero_cnt,
    CAST(zero_cnt AS FLOAT) / total_cnt * 100 AS percent -- Доля покупок с нулевой стоимостью от общего числа покупок
FROM zero, total; 

 /*|zero_cnt|percent     |
   |--------|------------|
   |907     |0,0693595824|
   
Всего покупок с нулевой стоимостью: 907 (~0.07% от общего числа).

Вывод: Доля таких покупок незначительна. Возможно, это тестовые транзакции или ошибки системы. Рекомендуется изучить их происхождение.*/


-- 2.3: Сравнительный анализ активности платящих и неплатящих игроков:
     

  WITH player_activity AS ( 
    select
        u.id AS player_id, -- все пользователи
        CASE
            WHEN u.payer = 1 THEN 'Платящие'                    
            ELSE 'Неплатящие'
        END AS player_group,
        COUNT(e.transaction_id) AS purchase_count, -- количество покупок
        SUM(e.amount) AS total_amount -- общая стоимость
    FROM fantasy.users u
    JOIN fantasy.events e ON u.id = e.id                        
    WHERE e.amount > 0                                          
    group by u.id, player_group),
     player_activity_grouped AS (
    SELECT
        player_group,
        COUNT(*) AS total_players,
        ROUND(AVG(purchase_count::NUMERIC), 2) AS avg_purchase_count,  -- среднее количество покупок
        ROUND(AVG(total_amount)::NUMERIC, 2) AS avg_total_amount -- среднее значение общего количества
    FROM player_activity
    GROUP BY player_group)
SELECT * 
from player_activity_grouped;

/*|player_group|total_players|avg_purchase_count|avg_total_amount|
  |------------|-------------|------------------|----------------|
  |Платящие    |2 444        |81,68             |55 467,74       |
  |Неплатящие  |11 348       |97,56             |48 631,74       |
  

Среднее количество покупок у неплатящих игроков выше (97.56 vs. 81.68).
Средняя сумма покупок у платящих игроков выше (55 467.74 vs. 48 631.74).

Вывод: Неплатящие игроки более активны в количественном выражении, но платящие тратят больше в денежном эквиваленте. Это может указывать на то, что платящие игроки делают более дорогие, но редкие покупки.*/



-- 2.4: Популярные эпические предметы:

SELECT game_items,  
    COUNT(amount) as number, 
    (COUNT(amount)::FLOAT / (SELECT COUNT(amount) FROM fantasy.events)) AS rel_number,
    COUNT (DISTINCT id),
    COUNT (DISTINCT id)::FLOAT / (SELECT COUNT(DISTINCT id) FROM fantasy.events) as "%"
FROM fantasy.events
RIGHT JOIN fantasy.items USING(item_code)
WHERE amount <> 0
GROUP BY game_items
ORDER BY number DESC;

/*
|game_items               |number   |rel_number  |count |%           |
|-------------------------|---------|------------|------|------------|
|Book of Legends          |1 004 516|0,7681676988|12 194|0,8840716305|
|Bag of Holding           |271 875  |0,2079066865|11 968|0,8676865076|
|Necklace of Wisdom       |13 828   |0,0105744686|1 627 |0,1179583847|
|Gems of Insight          |3 833    |0,0029311497|926   |0,0671355035|
|Treasure Map             |3 183    |0,0024340855|819   |0,0593779453|
|Amulet of Protection     |1 078    |0,000824362 |445   |0,032262742 |
|Silver Flask             |795      |0,0006079478|633   |0,0458928442|
|Strength Elixir          |580      |0,0004435343|331   |0,02399768  |
|Glowing Pendant          |563      |0,0004305341|354   |0,0256651925|
|Gauntlets of Might       |514      |0,0003930631|281   |0,0203726528|
|Sea Serpent Scale        |458      |0,0003502391|59    |0,0042775321|
|Ring of Wisdom           |379      |0,0002898267|310   |0,0224751686|
|Potion of Speed          |375      |0,0002867678|231   |0,0167476256|
|Magic Ornament           |282      |0,0002156494|113   |0,0081925614|
|Ring of Invisibility     |252      |0,000192708 |184   |0,0133401001|
|Magical Lantern          |247      |0,0001888844|102   |0,0073950555|
|Herbs for Potions        |241      |0,0001842961|148   |0,0107300805|
|Potion of Acceleration   |230      |0,0001758843|180   |0,0130500979|
|Feather of Writing       |222      |0,0001697666|154   |0,0111650837|
|Enemy Traps              |168      |0,000128472 |94    |0,0068150511|
|Time Artifact            |168      |0,000128472 |148   |0,0107300805|
|Scroll of Magic          |162      |0,0001238837|117   |0,0084825636|
|Monster Compendium       |151      |0,0001154719|138   |0,010005075 |
|Water of Life            |142      |0,0001085894|122   |0,0088450663|
|Pegasus Feather          |138      |0,0001055306|26    |0,0018850141|
|Trap Chest               |137      |0,0001047659|120   |0,0087000653|
|Magic Key                |127      |0,0000971187|81    |0,005872544 |
|Dungeon Map              |108      |0,0000825891|74    |0,0053650402|
|Runes of Power           |106      |0,0000810597|73    |0,0052925397|
|Antidote Potion          |89       |0,0000680596|47    |0,0034075256|
|Robe of the Magi         |85       |0,0000650007|80    |0,0058000435|
|Druid's Staff            |83       |0,0000634713|61    |0,0044225332|
|Mystic Compass           |83       |0,0000634713|54    |0,0039150294|
|Magic Dust               |82       |0,0000627066|72    |0,0052200392|
|Treasure Box             |79       |0,0000604124|46    |0,003335025 |
|Boots of Levitation      |73       |0,0000558241|55    |0,0039875299|
|Chimera Scale            |67       |0,0000512359|55    |0,0039875299|
|Enhanced Weapon          |60       |0,0000458829|41    |0,0029725223|
|Helm of Insight          |57       |0,0000435887|32    |0,0023200174|
|Phoenix Feather          |56       |0,000042824 |19    |0,0013775103|
|Orb of Time              |56       |0,000042824 |39    |0,0028275212|
|Potion of Intelligence   |50       |0,0000382357|47    |0,0034075256|
|Scroll of Summoning      |49       |0,000037471 |37    |0,0026825201|
|Orc Tusk                 |45       |0,0000344121|35    |0,002537519 |
|Quiver of Endless Arrows |45       |0,0000344121|19    |0,0013775103|
|Elf Ears                 |44       |0,0000336474|39    |0,0028275212|
|Shield of Valor          |38       |0,0000290591|28    |0,0020300152|
|Succubus Kiss            |35       |0,000026765 |25    |0,0018125136|
|Potion of Fortitude      |31       |0,0000237061|28    |0,0020300152|
|Boots of Swiftness       |29       |0,0000221767|24    |0,0017400131|
|Potion of Transformation |28       |0,000021412 |22    |0,001595012 |
|Scroll of Resurrection   |27       |0,0000206473|21    |0,0015225114|
|Transformation Potion    |26       |0,0000198826|24    |0,0017400131|
|Pendant of Healing       |25       |0,0000191179|22    |0,001595012 |
|Medallion of Magic       |24       |0,0000183531|19    |0,0013775103|
|Fire Resistance Potion   |22       |0,0000168237|15    |0,0010875082|
|Fairy Dust               |21       |0,000016059 |13    |0,0009425071|
|Mirror of Divination     |21       |0,000016059 |19    |0,0013775103|
|Armor of Magic Resistance|21       |0,000016059 |21    |0,0015225114|
|Potion of Regeneration   |20       |0,0000152943|17    |0,0012325092|
|Nature's Strength Potion |20       |0,0000152943|18    |0,0013050098|
|Enchanter's Amulet       |19       |0,0000145296|19    |0,0013775103|
|Crown of Kings           |18       |0,0000137649|18    |0,0013050098|
|Cloak of Shadows         |15       |0,0000114707|15    |0,0010875082|
|Dragon Cart              |15       |0,0000114707|11    |0,000797506 |
|Shield of Protection     |14       |0,000010706 |14    |0,0010150076|
|Potion of Light          |13       |0,0000099413|11    |0,000797506 |
|Kraken Ink               |13       |0,0000099413|11    |0,000797506 |
|Invisibility Potion      |12       |0,0000091766|10    |0,0007250054|
|Stone of Power           |12       |0,0000091766|11    |0,000797506 |
|Wyvern Claw              |11       |0,0000084119|6     |0,0004350033|
|Magic Animal             |11       |0,0000084119|10    |0,0007250054|
|Hydra Tooth              |10       |0,0000076471|9     |0,0006525049|
|Defender's Guard         |10       |0,0000076471|7     |0,0005075038|
|Traveler's Supplies      |10       |0,0000076471|6     |0,0004350033|
|Vampire Fang             |10       |0,0000076471|8     |0,0005800044|
|Potion of Wisdom         |9        |0,0000068824|8     |0,0005800044|
|Protective Cloak         |9        |0,0000068824|6     |0,0004350033|
|Staff of Flames          |9        |0,0000068824|8     |0,0005800044|
|Potion of Darkness       |8        |0,0000061177|7     |0,0005075038|
|Ancient Artifact         |8        |0,0000061177|4     |0,0002900022|
|Unicorn Horn             |8        |0,0000061177|4     |0,0002900022|
|Ethereal Horse           |7        |0,000005353 |6     |0,0004350033|
|Weapon Oil               |7        |0,000005353 |4     |0,0002900022|
|Mystic Bracelets         |6        |0,0000045883|5     |0,0003625027|
|Book of Spells           |6        |0,0000045883|5     |0,0003625027|
|Book of Curses           |6        |0,0000045883|5     |0,0003625027|
|Amulet of Time           |6        |0,0000045883|6     |0,0004350033|
|Griffin Feather          |6        |0,0000045883|4     |0,0002900022|
|Luminescent Gem          |6        |0,0000045883|5     |0,0003625027|
|Sorcerer's Stone         |5        |0,0000038236|5     |0,0003625027|
|Magic Sand               |5        |0,0000038236|2     |0,0001450011|
|Potion of Clarity        |5        |0,0000038236|4     |0,0002900022|
|Shovel of Secrets        |5        |0,0000038236|4     |0,0002900022|
|Silver Talons            |5        |0,0000038236|5     |0,0003625027|
|Weapon Decoration        |5        |0,0000038236|4     |0,0002900022|
|Ring of Strength         |4        |0,0000030589|3     |0,0002175016|
|Talisman of Luck         |4        |0,0000030589|2     |0,0001450011|
|Healer's Kit             |4        |0,0000030589|4     |0,0002900022|
|Diviner's Tarot Deck     |4        |0,0000030589|3     |0,0002175016|
|Wand of Lightning        |4        |0,0000030589|4     |0,0002900022|
|Crystal of Wisdom        |4        |0,0000030589|3     |0,0002175016|
|Magic Orb                |4        |0,0000030589|4     |0,0002900022|
|Prophet's Scroll         |4        |0,0000030589|4     |0,0002900022|
|Gold Coins               |4        |0,0000030589|4     |0,0002900022|
|Cleansing Potion         |3        |0,0000022941|2     |0,0001450011|
|Quill of Enchantment     |3        |0,0000022941|2     |0,0001450011|
|Compass of Truth         |3        |0,0000022941|1     |0,0000725005|
|Ring of Regeneration     |3        |0,0000022941|3     |0,0002175016|
|Boots of Haste           |3        |0,0000022941|3     |0,0002175016|
|Flask of Endless Water   |3        |0,0000022941|3     |0,0002175016|
|Cloak of Invisibility    |2        |0,0000015294|2     |0,0001450011|
|Paladin's Hammer         |2        |0,0000015294|2     |0,0001450011|
|Mystic's Rune Stones     |2        |0,0000015294|2     |0,0001450011|
|Necromancer's Wand       |2        |0,0000015294|2     |0,0001450011|
|Medusa's Snake           |2        |0,0000015294|2     |0,0001450011|
|Warlock's Grimoire       |2        |0,0000015294|2     |0,0001450011|
|Knight's Shield          |2        |0,0000015294|2     |0,0001450011|
|Protection Potion        |2        |0,0000015294|2     |0,0001450011|
|Book of Rituals          |2        |0,0000015294|2     |0,0001450011|
|Bandages of Recovery     |2        |0,0000015294|2     |0,0001450011|
|Manticore Tail           |2        |0,0000015294|2     |0,0001450011|
|Mermaid's Tear           |1        |0,0000007647|1     |0,0000725005|
|Sword of Flames          |1        |0,0000007647|1     |0,0000725005|
|Sword of Ice             |1        |0,0000007647|1     |0,0000725005|
|Map of Realms            |1        |0,0000007647|1     |0,0000725005|
|Elixir of Mana           |1        |0,0000007647|1     |0,0000725005|
|Gloves of Strength       |1        |0,0000007647|1     |0,0000725005|
|Magic Carpet             |1        |0,0000007647|1     |0,0000725005|
|Dragon Scale             |1        |0,0000007647|1     |0,0000725005|
|Potion of Power          |1        |0,0000007647|1     |0,0000725005|
|Scroll of Fireball       |1        |0,0000007647|1     |0,0000725005|
|Elixir of Night Vision   |1        |0,0000007647|1     |0,0000725005|
|Bow of Precision         |1        |0,0000007647|1     |0,0000725005|
|Bow of Magic             |1        |0,0000007647|1     |0,0000725005|
|Mystic Armor             |1        |0,0000007647|1     |0,0000725005|
|Boots of Silence         |1        |0,0000007647|1     |0,0000725005|
|Incubus Whisper          |1        |0,0000007647|1     |0,0000725005|
|Demon's Horn             |1        |0,0000007647|1     |0,0000725005|
|Werewolf Fur             |1        |0,0000007647|1     |0,0000725005|
|Spectral Shield          |1        |0,0000007647|1     |0,0000725005|
|Monk's Prayer Beads      |1        |0,0000007647|1     |0,0000725005|
|Minotaur Horn            |1        |0,0000007647|1     |0,0000725005|
|Stone of Teleportation   |1        |0,0000007647|1     |0,0000725005|


Топ-2 предмета (Book of Legends и Bag of Holding) составляют ~97.7% всех покупок.

Остальные предметы имеют крайне низкую популярность (доли менее 1.1%).

Вывод: Игроки концентрируются на двух основных предметах. Остальные предметы практически не востребованы, что может указывать на их слабую полезность или высокую стоимость.*/




-- Часть 2. Решение ad hoc-задач
-- Задача 1. Зависимость активности игроков от расы персонажа

WITH race_gamers AS (
    SELECT
        r.race,
        COUNT(u.id) AS gamer_count                           
    FROM fantasy.users u
    JOIN fantasy.race r ON u.race_id = r.race_id
    GROUP BY r.race),
user_activities AS (
    SELECT
        r.race,
        u.id,
        u.payer,
        COUNT(e.transaction_id) AS purchases_count,   -- количество покупок
        SUM(e.amount) AS total_spendings              -- общая сумма затрат
    FROM fantasy.users u
    JOIN fantasy.race r ON u.race_id = r.race_id
    INNER JOIN fantasy.events e ON u.id = e.id
    GROUP BY r.race, u.id, u.payer),
aggregated_data AS (
    SELECT
        ua.race,
        COUNT(ua.id) AS registered_players,                                                     -- зарегистрированные игроки
        SUM(CASE WHEN ua.purchases_count > 0 THEN 1 ELSE 0 END) AS players_with_purchases,      -- игроки с покупками
        SUM(CASE WHEN ua.payer = 1 THEN 1 ELSE 0 END) AS paying_players,                        -- платящие игроки           
        ROUND(AVG(ua.purchases_count),2) AS average_purchases_per_player,                       -- среднее количество покупок на игрока        
        AVG(ua.total_spendings)/AVG(ua.purchases_count) AS average_cost_per_purchase,           -- средняя стоимость одной покупки
        AVG(ua.total_spendings) AS average_total_spendings                                      -- средние общие траты
    FROM user_activities ua
    GROUP BY ua.race)
SELECT
    ad.race,
    rg.gamer_count,
    ad.players_with_purchases,
    CAST(ad.players_with_purchases AS FLOAT) / rg.gamer_count AS purchasing_ratio,         
    CAST(ad.paying_players AS FLOAT) / ad.players_with_purchases AS paying_ratio,
    ad.average_purchases_per_player,
    ad.average_cost_per_purchase,
    ad.average_total_spendings
FROM aggregated_data ad
JOIN race_gamers rg ON ad.race = rg.race; 

/*
|race    |gamer_count|players_with_purchases|purchasing_ratio|paying_ratio|average_purchases_per_player|average_cost_per_purchase|average_total_spendings|
|--------|-----------|----------------------|----------------|------------|----------------------------|-------------------------|-----------------------|
|Angel   |1 327      |820                   |0,6179351922    |0,1670731707|106,82                      |455,6001602939           |48 668,6537084675      |
|Demon   |1 229      |737                   |0,5996745321    |0,1994572592|77,87                       |529,0550409679           |41 197,3796487722      |
|Elf     |2 501      |1 543                 |0,6169532187    |0,1626701231|79,32                       |677,7583354369           |53 761,6535747261      |
|Hobbit  |3 648      |2 267                 |0,6214364035    |0,1768857521|86,1                        |552,8493792657           |47 599,9169787115      |
|Human   |6 328      |3 921                 |0,6196270544    |0,1800561081|121,41                      |403,1125527779           |48 941,0098506477      |
|Northman|3 562      |2 229                 |0,6257720382    |0,1821444594|82,11                       |761,434751447            |62 520,6593291054      |
|Orc     |3 619      |2 276                 |0,6289030119    |0,1739894552|81,74     


Наибольшая средняя стоимость покупки у Эльфов (~677.76) и Нордменов (~761.43).
Наибольшее среднее количество покупок у Людей (121.41).

Вывод: Раса влияет на поведение игроков. Люди совершают больше покупок, но Эльфы и Нордмены тратят больше за одну транзакцию. Это может быть связано с особенностями игровых механик для этих рас.



ОБЩИЕ ВЫВОДЫ:

Анализ монетизации показывает, что текущая доля платящих игроков (17.7%) соответствует рыночным стандартам для free-to-play проектов, при этом основной доход формируется за счет небольшой группы "китов", 
совершающих крупные транзакции. Исследование игровых рас выявило интересные закономерности: игроки, выбравшие Демонов и Хоббитов, демонстрируют более высокую склонность к покупкам, тогда как Эльфы и Нордмены 
хотя и совершают покупки реже, но тратят существенно больше за одну транзакцию - эти данные представляют ценность для разработки таргетированных маркетинговых стратегий. Особого внимания заслуживает распределение 
покупок предметов: всего два игровых предмета генерируют 97% всех продаж, в то время как остальные практически не востребованы, что явно указывает на необходимость пересмотра их баланса и ценности. Примечательно,
что неплатящие игроки проявляют большую активность в количественном выражении, однако именно платящая аудитория обеспечивает основной доход, что подчеркивает важность комплексного подхода к удержанию обеих категорий пользователей.

РЕКОМЕНДАЦИИ:
Для улучшения монетизации и игрового опыта рекомендуется провести балансировку предметов: увеличить полезность или снизить стоимость непопулярных предметов, а также добавить им уникальные эффекты, 
чтобы стимулировать покупки. Следует внедрить таргетированный маркетинг: для рас с высокой долей платящих игроков (Демоны, Хоббиты) предлагать персонализированные предложения, а для рас с высокой 
средней стоимостью покупки (Эльфы, Нордмены) — премиум-контент. Важно работать с "китами" — ввести систему бонусов или статусов для игроков, совершающих крупные покупки, и предложить им эксклюзивные 
предметы или услуги. Также необходимо проанализировать причины нулевых транзакций и устранить возможные ошибки. Для стимулирования неплатящих игроков можно ввести механику "пробных" покупок (например, 
скидки на первый платеж) и увеличить ценность бесплатного контента, чтобы удержать их активность. Эти меры помогут увеличить конверсию в платящих игроков и повысить средний чек..*/

